[
    {
        "picture_url": "https://i.ibb.co/6NKVSzJ/tzjpl51l.png",
        "name": "Iron Man",
        "sub_category": "Marvel",
        "price": 24.99,
        "rating": 4.8,
        "available_quantity": 5,
        "description": "Unleash the power of Iron Man with this incredible action figure. Inspired by Tony Stark's high-tech armor, this toy features intricate detailing and vibrant colors. Standing at 6 inches tall, Iron Man comes with interchangeable hands and blast effects. Join the Avengers and add this Marvel hero to your collection!"
      }
,
{
    "picture_url": "https://i.ibb.co/FVpbfd9/spider.jpg",
    "name": "Spider-Man",
    "sub_category": "Marvel",
    "price": 29.99,
    "rating": 4.7,
    "available_quantity": 3,
    "description": "Swing into action with the Spider-Man action figure! This toy captures the agility and charm of Peter Parker's alter ego. With detailed sculpting and web-slinging poses, Spider-Man stands at 5.5 inches tall. Collect this iconic Marvel hero and recreate thrilling adventures from the comics or movies!"
  }
,   {
    "picture_url": "https://i.ibb.co/YyMzCtB/america.jpg",
    "name": "Captain America",
    "sub_category": "Marvel",
    "price": 21.99,
    "rating": 4.6,
    "available_quantity": 8,
    "description": "Unleash the patriotism and strength of Captain America with this amazing action figure. Featuring a highly detailed costume and shield, this toy captures the essence of Steve Rogers. Standing at 6 inches tall, Captain America is poseable and ready for action. Join the Avengers and add this Marvel hero to your collection!"
  },
  {
    "picture_url": "https://i.ibb.co/gPtTXNp/6uo6rl3j.png",
    "name": "Hulk",
    "sub_category": "Marvel",
    "price": 18.99,
    "rating": 4.5,
    "available_quantity": 6,
    "description": "Unleash the incredible power of the Hulk with this action figure. This toy showcases the massive size and muscular form of Bruce Banner's alter ego. Standing at 7 inches tall, the Hulk comes with a roaring expression and massive fists. Smash through any obstacle with this incredible Marvel hero!"
  }
,
{
    "picture_url": "https://i.ibb.co/47tFBkS/Screenshot-37.jpg",
    "name": "Thor",
    "sub_category": "Marvel",
    "price": 23.99,
    "rating": 4.4,
    "available_quantity": 7,
    "description": "Harness the power of Thor with this mighty action figure. Inspired by the God of Thunder, this toy features a detailed costume and Mjolnir, Thor's legendary hammer. Standing at 6 inches tall, Thor is fully poseable and ready to defend Asgard. Add this Marvel hero to your collection and join the ranks of the Avengers!"
  }
,
{
    "picture_url": "https://i.ibb.co/0FqjH3G/xouodc6i.png",
    "name": "Black Widow",
    "sub_category": "Marvel",
    "price": 25.99,
    "rating": 4.3,
    "available_quantity": 4,
    "description": "Unleash the spy skills and combat prowess of Black Widow with this action figure. With her sleek black costume and determined expression, this toy captures Natasha Romanoff's stealth and strength. Standing at 5.5 inches tall, Black Widow comes with various accessories, including weapons and a display stand. Add this Marvel hero to your collection and create thrilling espionage missions!"
  },
  {
    "picture_url": "https://i.ibb.co/7VMb6m6/doctor.jpg",
    "name": "Doctor Strange",
    "sub_category": "Marvel",
    "price": 20.99,
    "rating": 4.5,
    "available_quantity": 9,
    "description": "Unleash the mystical powers of Doctor Strange with this incredible action figure. Inspired by the Sorcerer Supreme, this toy features intricate detailing and a vibrant costume. Standing at 6 inches tall, Doctor Strange comes with spell effect accessories and a mystical artifact. Add this Marvel hero to your collection and explore the realms of magic!"
  }
,
{
    "picture_url": "https://i.ibb.co/sHfD0L4/black.jpg",
    "name": "Black Panther",
    "sub_category": "Marvel",
    "price": 16.99,
    "rating": 4.2,
    "available_quantity": 12,
    "description": "Embrace the power of the Black Panther with this action figure. Inspired by T'Challa's iconic suit, this toy features intricate sculpting and vibranium-inspired accents. Standing at 6 inches tall, Black Panther is fully poseable and comes with a claw accessory. Join the Avengers and add this Marvel hero to your collection!"
  },
  {
    "picture_url": "https://i.ibb.co/dBvhf8M/hqudf1pr.png",
    "name": "Batman",
    "sub_category": "DC",
    "price": 24.99,
    "rating": 4.8,
    "available_quantity": 5,
    "description": "The Batman toy brings the Dark Knight to life! This action figure captures the essence of Batman with its detailed sculpting and realistic costume. It stands at 7 inches tall and comes with various accessories, including Batarangs and a grappling hook. Whether you're a fan of the comics or the movies, this Batman toy is a must-have for any DC enthusiast."
  }
,  {
    "picture_url": "https://i.ibb.co/4FVsgCq/superman.jpg",
    "name": "Superman",
    "sub_category": "DC",
    "price": 29.99,
    "rating": 4.7,
    "available_quantity": 3,
    "description": "Embrace the power of Superman with this incredible action figure. The toy features a highly detailed sculpt and a vibrant costume, showcasing the iconic 'S' symbol. Standing at 6.5 inches tall, this Superman toy is poseable and comes with a removable cape. Whether you're a fan of his strength or his inspiring heroism, this toy is a fantastic addition to your collection."
  }
,
{
    "picture_url": "https://i.ibb.co/3rTT0jp/61kseasy.png",
    "name": "Wonder Woman",
    "sub_category": "DC",
    "price": 21.99,
    "rating": 4.6,
    "available_quantity": 8,
    "description": "Unleash the power of Wonder Woman with this stunning action figure. With intricate detailing and a fierce expression, this toy captures the essence of the Amazonian warrior. Standing at 6 inches tall, Wonder Woman comes with her iconic Lasso of Truth and a shield. Display her in your collection or create dynamic battle scenes for imaginative play!"
  }
,
{
    "picture_url": "https://i.ibb.co/cN3YYmr/flash.jpg",
    "name": "The Flash",
    "sub_category": "DC",
    "price": 18.99,
    "rating": 4.5,
    "available_quantity": 6,
    "description": "Zoom into action with The Flash action figure! This toy captures the lightning-fast speedster in intricate detail, from his vibrant costume to his determined expression. Standing at 5.5 inches tall, The Flash is fully articulated, allowing for dynamic poses. Complete your Justice League collection with this fantastic toy."
  }
,  {
    "picture_url": "https://i.ibb.co/K075CFL/aquaman.jpg",
    "name": "Aquaman",
    "sub_category": "DC",
    "price": 23.99,
    "rating": 4.4,
    "available_quantity": 7,
    "description": "Dive into adventure with the Aquaman action figure. This toy features incredible detailing, capturing the King of Atlantis in all his glory. With his trident in hand and a determined expression, Aquaman stands at 6.5 inches tall. Pose him alongside other DC heroes or create your own underwater battles!"
  }
,
{
    "picture_url": "https://i.ibb.co/pbrmCf0/greenlan37.jpg",
    "name": "Green Lantern",
    "sub_category": "DC",
    "price": 25.99,
    "rating": 4.3,
    "available_quantity": 4,
    "description": "Join the Green Lantern Corps with this awesome action figure. This toy showcases the iconic Green Lantern suit with intricate sculpting and vibrant colors. Standing at 6 inches tall, it comes with a power ring and a lantern accessory. Bring the power of willpower and imagination to your collection with this Green Lantern toy!"
  }
,
{
    "picture_url": "https://i.ibb.co/khZHqGg/batgirl.jpg",
    "name": "Batgirl",
    "sub_category": "DC",
    "price": 20.99,
    "rating": 4.5,
    "available_quantity": 9,
    "description": "Get ready for action with the Batgirl action figure. With her iconic costume and determined expression, this toy captures Batgirl's strength and intelligence. Standing at 5.5 inches tall, she comes with a Batarang and a utility belt. Add this empowering heroine to your DC collection!"
  }
,
{
    "picture_url": "https://i.ibb.co/YkT3VFv/robin.jpg",
    "name": "Robin",
    "sub_category": "DC",
    "price": 16.99,
    "rating": 4.2,
    "available_quantity": 12,
    "description": "Join Batman's sidekick with this Robin action figure. Featuring the Boy Wonder's classic costume and a confident pose, this toy is a great addition to any Batman or DC fan's collection. Standing at 5 inches tall, Robin comes with a bo staff and multiple points of articulation for dynamic play."
  }
  
  
  
  
]